jmeter/results/full-program-html/statistics.json
{
  "POST Login (usuario)" : {
    "transaction" : "POST Login (usuario)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1600.0,
    "medianResTime" : 1600.0,
    "minResTime" : 1600.0,
    "maxResTime" : 1600.0,
    "pct1ResTime" : 1600.0,
    "pct2ResTime" : 1600.0,
    "pct3ResTime" : 1600.0,
    "throughput" : 0.625,
    "receivedKBytesPerSec" : 0.4180908203125,
    "sentKBytesPerSec" : 0.224609375
  },
  "GET Cuarentena Supervisor" : {
    "transaction" : "GET Cuarentena Supervisor",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 15.0,
    "throughput" : 66.66666666666667,
    "receivedKBytesPerSec" : 32.87760416666667,
    "sentKBytesPerSec" : 20.3125
  },
  "GET Audit Log Supervisor" : {
    "transaction" : "GET Audit Log Supervisor",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.0,
    "medianResTime" : 45.0,
    "minResTime" : 45.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 45.0,
    "throughput" : 22.22222222222222,
    "receivedKBytesPerSec" : 11.371527777777779,
    "sentKBytesPerSec" : 6.749131944444445
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 391.33333333333337,
    "medianResTime" : 45.0,
    "minResTime" : 15.0,
    "maxResTime" : 1600.0,
    "pct1ResTime" : 1600.0,
    "pct2ResTime" : 1600.0,
    "pct3ResTime" : 1600.0,
    "throughput" : 2.204261572373255,
    "receivedKBytesPerSec" : 1.2131092334068088,
    "sentKBytesPerSec" : 0.5965091538084741
  },
  "GET Pendientes Supervisor" : {
    "transaction" : "GET Pendientes Supervisor",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.0,
    "medianResTime" : 33.0,
    "minResTime" : 33.0,
    "maxResTime" : 33.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 33.0,
    "throughput" : 30.303030303030305,
    "receivedKBytesPerSec" : 15.506628787878787,
    "sentKBytesPerSec" : 9.232954545454545
  },
  "GET CSRF (supervisor)" : {
    "transaction" : "GET CSRF (supervisor)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.0,
    "medianResTime" : 85.0,
    "minResTime" : 85.0,
    "maxResTime" : 85.0,
    "pct1ResTime" : 85.0,
    "pct2ResTime" : 85.0,
    "pct3ResTime" : 85.0,
    "throughput" : 11.76470588235294,
    "receivedKBytesPerSec" : 6.364889705882352,
    "sentKBytesPerSec" : 1.4361213235294117
  },
  "GET CSRF (usuario)" : {
    "transaction" : "GET CSRF (usuario)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.0,
    "medianResTime" : 85.0,
    "minResTime" : 85.0,
    "maxResTime" : 85.0,
    "pct1ResTime" : 85.0,
    "pct2ResTime" : 85.0,
    "pct3ResTime" : 85.0,
    "throughput" : 11.76470588235294,
    "receivedKBytesPerSec" : 6.364889705882352,
    "sentKBytesPerSec" : 1.4361213235294117
  },
  "GET Álbumes Públicos" : {
    "transaction" : "GET Álbumes Públicos",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.0,
    "medianResTime" : 33.0,
    "minResTime" : 33.0,
    "maxResTime" : 33.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 33.0,
    "throughput" : 30.303030303030305,
    "receivedKBytesPerSec" : 14.94436553030303,
    "sentKBytesPerSec" : 7.605350378787878
  },
  "POST Login (supervisor)" : {
    "transaction" : "POST Login (supervisor)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1600.0,
    "medianResTime" : 1600.0,
    "minResTime" : 1600.0,
    "maxResTime" : 1600.0,
    "pct1ResTime" : 1600.0,
    "pct2ResTime" : 1600.0,
    "pct3ResTime" : 1600.0,
    "throughput" : 0.625,
    "receivedKBytesPerSec" : 0.4254150390625,
    "sentKBytesPerSec" : 0.2294921875
  },
  "GET Álbumes del Usuario" : {
    "transaction" : "GET Álbumes del Usuario",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.0,
    "medianResTime" : 26.0,
    "minResTime" : 26.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 26.0,
    "throughput" : 38.46153846153847,
    "receivedKBytesPerSec" : 19.681490384615387,
    "sentKBytesPerSec" : 11.568509615384617
  }
}